KnowledgeLake Search Mobile/app/services/sharepoint/soapTemplates/SiteData/GetURLSegments.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Body>
		<GetURLSegments xmlns="http://schemas.microsoft.com/sharepoint/soap/">
			<strURL>{strURL}</strURL>
		</GetURLSegments>
	</soap:Body>
</soap:Envelope>